/*
 * key.c
 *
 *  Created on: Oct 27, 2021
 *      Author: jiangyuanyuan
 */
  
/************************************1-头文件**********************************/
#include "key.h"
#include "led.h"
#include "delay.h"
/**************************************end*************************************/

/************************************2-宏定义**********************************/

/*************************************end**************************************/

/***********************************3-变量定义*********************************/

/*************************************End**************************************/

/**********************************4-初始化函数********************************/
void Key_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};
	__HAL_RCC_GPIO_CLK_ENABLE();
	
	GPIO_InitStruct.Pin = GPIO_PIN_5;
	GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
	GPIO_InitStruct.Pull = GPIO_PULLUP;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
	
	HAL_NVIC_SetPriority(GPIOB_IRQn, 0);
	HAL_NVIC_EnableIRQ(GPIOB_IRQn);
}
/**************************************end*************************************/

/***********************************5-回调函数*********************************/
void HAL_GPIO_EXTI_Callback(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin)
{
	if ((GPIOx == GPIOB) && (GPIO_Pin == GPIO_PIN_5))
	{
		delay_ms(20);
		if ((GPIOx == GPIOB) && (GPIO_Pin == GPIO_PIN_5))
		{
			Led1_Toggle();
		}
	}
}
/**************************************end*************************************/

/*********************************6-API接口函数********************************/

/**************************************end*************************************/